package constants;

import java.util.Arrays;
import java.util.List;

public class Constants {
    public static final List<Character> ALPHABET_RUS = Arrays.asList('а', 'б', 'в',
            'г', 'д', 'е', 'ж', 'з', 'и', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у',
            'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'я', '.', ',', '«', '»',
            ':', '!', '?', ' ');

    public static final List<Character> ALPHABET_ENG = Arrays.asList('a', 'b', 'c',
            'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's',
            't', 'u', 'v', 'w', 'x', 'y', 'z', '.', ',', '«', '»',
            ':', '!', '?', ' ');


    public static final char[] ALPHABET1 = {'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з',
            'и', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ',
            'ъ', 'ы', 'ь', 'э', 'я', '.', ',', '«', '»', '"', '\'', ':', '!', '?', ' '};

    public static final String CHOOSE_A_TASK = """
            ====================================================
            Выберите тип задачи:
            1 - Шифровка текста из заданного файла
            2 - Расшифровка при известном ключе
            3 - Расшифровка методом brute force
            4 - Расшифровка методом статистического анализа
            5 - EXIT
            ====================================================""";
    public static final String CHOOSE_A_LANGUAGE = """
            ****************************************************
            Выберите язык для задачи:
            1 - Русский
            2 - English
            3 - EXIT
            ****************************************************""";
    //public static final String
}
